from db.db_classes import connect_db, ProfessionsTable, CoursesTable
from pydantic import BaseModel


class Profession:
    def __init__(self, name: str) -> None:
        self.name = name
        self.description = "description of profession: " + self.name


conn = connect_db()
proff = [
    "Архитектор",
    "Строитель",
    "Риэлтор",
    "Ландшафтный дизайнер",
    "Ландшафтный архитектор",
    "Ученый",
    "Археолог",
    "Научный сотрудник",
    "Учитель",
    "Библиотекарь",
    "Менеджер по проектам",
    "Экономист",
    "Исполнительный директор",
    "Консультант по управлению",
    "Сисадмин",
    "Программист",
    "Специалист по кибербезопасности",
    "Аналитик данных",
    "Инженер по тестированию ПО",
    "Врач",
    "Фармацевт",
    "Физиотерапевт",
    "Нутрициолог",
    "Психотерапевт",
    "Финансовый аналитик",
    "Бухгалтер",
    "Инвестиционный аналитик",
    "Финансовый консультант",
    "Аудитор",
    "Технолог в машиностроении",
    "Инженер-механик",
    "Робототехник",
    "Монтажник оборудования",
    "Военный офицер",
    "Солдат",
    "Военный медик",
    "Инженер-исследователь",
    "Научный исследователь",
    "Биолог",
    "Физик",
    "Химик",
    "Менеджер по продажам",
    "Продавец-консультант",
    "Кассир",
    "Рабочий на производстве",
    "Технолог по текстилю",
    "Швея",
    "Дизайнер легкой промышленности",
    "Маркетолог",
    "Рекламщик",
    "Рукрутер",
    "Менеджер по продукту",
    "Водитель",
    "Логист",
    "Пилот",
    "Диспетчер",
    "Официант",
    "Парикмахер",
    "Мастер маникюра",
    "Бровист, Визажист",
    "Массажист",
    "Клининговая служба",
    "Гостиничный администратор",
    "Тур-агент",
    "Инженер по электронике и схемотехнике",
    "Инженер по проектированию микросхем",
    "Специалист по радиоэлектронике",
    "Художник",
    "Музыкант",
    "Режиссер",
    "Литературный редактор",
    "Спортивный тренер",
    "Професиональнй спортсмен",
    "Спортивный журналист",
    "Адвокат",
    "Судья",
    "Юрист корпорации",
    "Криминалист",
    "Фермер",
    "Агроном",
]
prof_data = list(map(lambda x: Profession(x), proff))
for i in prof_data:
    prof_unit = ProfessionsTable(name=i.name, description=i.description)
    conn.session.add(prof_unit)
    print(prof_unit.id)
    conn.session.commit()
    print(prof_unit.id)
    for i in range(3):
        course_unit = CoursesTable(
            course_name=f"course №{i} for profession {prof_unit.name}",
            description="some description for course",
            profession_id=prof_unit.id,
        )
        conn.session.add(course_unit)
        conn.session.commit()
        print(
            course_unit.course_name, course_unit.description, course_unit.profession_id
        )
conn.session.commit()
