file_mapping = {
      
    "Архитектура, строительство и недвижимость": {
    "keys/Архитектура, строительство и недвижимость/Архитектор":"Архитектор",
    "keys/Архитектура, строительство и недвижимость/Строитель":"Строитель",
    "keys/Архитектура, строительство и недвижимость/Риэлтор":"Риэлтор",
    "keys/Архитектура, строительство и недвижимость/Ландшафтный дизайнер":"Ландшафтный дизайнер"
    }, 
    "Наука и образование": {

    "keys/Наука и образование/Ученый":"Ученый",
    "keys/Наука и образование/Археолог":"Археолог",
    "keys/Наука и образование/Научный сотрудник":"Научный сотрудник",
    "keys/Наука и образование/Учитель":"Учитель",
    "keys/Наука и образование/Библиотекарь":"Библиотекарь"
    }, 
    "Бизнес, менеджмент и деловые услуги": {

    "keys/Бизнес, менеджмент и деловые услуги/Менеджер по проектам":"Менеджер по проектам",
    "keys/Бизнес, менеджмент и деловые услуги/Экономист":"Экономист",
    "keys/Бизнес, менеджмент и деловые услуги/Исполнительный директор":"Исполнительный директор",
    "keys/Бизнес, менеджмент и деловые услуги/Консультант по управлению":"Консультант по управлению"
    }, 
    "Информационные технологии и программирование": {

    "keys/Информационные технологии и программирование/Сисадмин":"Сисадмин",
    "keys/Информационные технологии и программирование/Программист":"Программист",
    "keys/Информационные технологии и программирование/Специалист по кибербезопасности":"Специалист по кибербезопасности",
    "keys/Информационные технологии и программирование/Аналитик данных":"Аналитик данных",
    "keys/Информационные технологии и программирование/Инженер по тестированию ПО":"Инженер по тестированию ПО"
    }, 
    "Медицина и здравоохранение": {

    "keys/Медицина и здравоохранение/Врач":"Врач",
    "keys/Медицина и здравоохранение/Фармацевт":"Фармацевт",
    "keys/Медицина и здравоохранение/Физиотерапевт":"Физиотерапевт",
    "keys/Медицина и здравоохранение/Нутрициолог":"Нутрициолог",
    "keys/Медицина и здравоохранение/Психотерапевт":"Психотерапевт"
    }, 
    "Финансы и бухгалтерия": {

    "keys/Финансы и бухгалтерия/Финансовый аналитик":"Финансовый аналитик",
    "keys/Финансы и бухгалтерия/Бухгалтер":"Бухгалтер",
    "keys/Финансы и бухгалтерия/Инвестиционный аналитик":"Инвестиционный аналитик",
    "keys/Финансы и бухгалтерия/Финансовый консультант":"Финансовый консультант",
    "keys/Финансы и бухгалтерия/Аудитор":"Аудитор"
    }, 
    "Машиностроение": {

    "keys/Машиностроение/Технолог в машиностроении":"Технолог в машиностроении",
    "keys/Машиностроение/Инженер-механик":"Инженер-механик",
    "keys/Машиностроение/Робототехник":"Робототехник",
    "keys/Машиностроение/Монтажник оборудования":"Монтажник оборудования"
    }, 
    "Военная служба": {

    "keys/Военная служба/Военный офицер":"Военный офицер",
    "keys/Военная служба/Солдат":"Солдат",
    "keys/Военная служба/Военный медик":"Военный медик"
    }, 
    "Исследования и разработки": {

    "keys/Исследования и разработки/Инженер-исследователь":"Инженер-исследователь",
    "keys/Исследования и разработки/Научный исследователь":"Научный исследователь",
    "keys/Исследования и разработки/Биолог":"Биолог",
    "keys/Исследования и разработки/Физик":"Физик",
    "keys/Исследования и разработки/Химик":"Химик"
    }, 
    "Торговля": {

    "keys/Торговля/Менеджер по продажам":"Менеджер по продажам",
    "keys/Торговля/Продавец-консультант":"Продавец-консультант",
    "keys/Торговля/Кассир":"Кассир"
    }, 
    "Легкая промышленность": {

    "keys/Легкая промышленность/Рабочий на производстве":"Рабочий на производстве",
    "keys/Легкая промышленность/Технолог по текстилю":"Технолог по текстилю",
    "keys/Легкая промышленность/Швея":"Швея",
    "keys/Легкая промышленность/Дизайнер легкой промышленности":"Дизайнер легкой промышленности"
    }, 
    "Сфера маркетинга и рекламы": {

    "keys/Сфера маркетинга и рекламы/Маркетолог":"Маркетолог",
    "keys/Сфера маркетинга и рекламы/Рекламщик":"Рекламщик",
    "keys/Сфера маркетинга и рекламы/Рукрутер":"Рукрутер",
    "keys/Сфера маркетинга и рекламы/Менеджер по продукту":"Менеджер по продукту"
    }, 
    "Транспорт и логистика": {

    "keys/Транспорт и логистика/Водитель":"Водитель",
    "keys/Транспорт и логистика/Логист":"Логист",
    "keys/Транспорт и логистика/Пилот":"Пилот",
    "keys/Транспорт и логистика/Диспетчер":"Диспетчер"
    }, 
    "Сфера обслуживания": {

    "keys/Сфера обслуживания/Официант":"Официант",
    "keys/Сфера обслуживания/Парикмахер":"Парикмахер",
    "keys/Сфера обслуживания/Мастер маникюра":"Мастер маникюра",
    "keys/Сфера обслуживания/Бровист, Визажист":"Бровист, Визажист",
    "keys/Сфера обслуживания/Массажист":"Массажист",
    "keys/Сфера обслуживания/Клининговая служба":"Клининговая служба"
    }, 
    "Туризм и гостеприимство": {

    "keys/Туризм и гостеприимство/Гостиничный администратор":"Гостиничный администратор",
    "keys/Туризм и гостеприимство/Тур-агент":"Тур-агент"
    }, 
    "Электроника и приборостроение": {

    "keys/Электроника и приборостроение/Инженер по электронике и схемотехнике":"Инженер по электронике и схемотехнике",
    "keys/Электроника и приборостроение/Инженер по проектированию микросхем":"Инженер по проектированию микросхем",
    "keys/Электроника и приборостроение/Специалист по радиоэлектронике":"Специалист по радиоэлектронике"
    }, 
    "Искусство и развлечения": {

    "keys/Искусство и развлечения/Художник":"Художник",
    "keys/Искусство и развлечения/Музыкант":"Музыкант",
    "keys/Искусство и развлечения/Режиссер":"Режиссер",
    "keys/Искусство и развлечения/Литературный редактор":"Литературный редактор"
    }, 
    "Спорт": {

    "keys/Спорт/Спортивный тренер":"Спортивный тренер",
    "keys/Спорт/Професиональнй спортсмен":"Професиональнй спортсмен",
    "keys/Спорт/Спортивный журналист":"Спортивный журналист"
    }, 
    "Право и юриспруденция": {

    "keys/Право и юриспруденция/Адвокат":"Адвокат",
    "keys/Право и юриспруденция/Судья":"Судья",
    "keys/Право и юриспруденция/Юрист корпорации":"Юрист корпорации",
    "keys/Право и юриспруденция/Криминалист":"Криминалист"
    }, 
    "Сельское хозяйство и лесное дело": {

    "keys/Сельское хозяйство и лесное дело/Фермер":"Фермер",
    "keys/Сельское хозяйство и лесное дело/Агроном":"Агроном",
    "keys/Сельское хозяйство и лесное дело/Ландшафтный архитектор":"Ландшафтный архитектор"
    } 


}

user_data = {
     
  "Архитектор":0,
  "Строитель":0,
  "Риэлтор":0,
  "Ландшафтный дизайнер":0,
  "Ученый":0,
  "Археолог":0,
  "Научный сотрудник":0,
  "Учитель":0,
  "Библиотекарь":0,
  "Менеджер по проектам":0,
  "Экономист":0,
  "Исполнительный директор":0,
  "Консультант по управлению":0,
  "Сисадмин":0,
  "Программист":0,
  "Специалист по кибербезопасности":0,
  "Аналитик данных":0,
  "Инженер по тестированию ПО":0,
  "Врач":0,
  "Фармацевт":0,
  "Физиотерапевт":0,
  "Нутрициолог":0,
  "Психотерапевт":0,
  "Финансовый аналитик":0,
  "Бухгалтер":0,
  "Инвестиционный аналитик":0,
  "Финансовый консультант":0,
  "Аудитор":0,
  "Технолог в машиностроении":0,
  "Инженер-механик":0,
  "Робототехник":0,
  "Монтажник оборудования":0,
  "Военный офицер":0,
  "Солдат":0,
  "Военный медик":0,
  "Инженер-исследователь":0,
  "Научный исследователь":0,
  "Биолог":0,
  "Физик":0,
  "Химик":0,
  "Менеджер по продажам":0,
  "Продавец-консультант":0,
  "Кассир":0,
  "Рабочий на производстве":0,
  "Технолог по текстилю":0,
  "Швея":0,
  "Дизайнер легкой промышленности":0,
  "Маркетолог":0,
  "Рекламщик":0,
  "Рукрутер":0,
  "Менеджер по продукту":0,
  "Водитель":0,
  "Логист":0,
  "Пилот":0,
  "Диспетчер":0,
  "Официант":0,
  "Парикмахер":0,
  "Мастер маникюра":0,
  "Бровист, Визажист":0,
  "Массажист":0,
  "Клининговая служба":0,
  "Гостиничный администратор":0,
  "Тур-агент":0,
  "Инженер по электронике и схемотехнике":0,
  "Инженер по проектированию микросхем":0,
  "Специалист по радиоэлектронике":0,
  "Художник":0,
  "Музыкант":0,
  "Режиссер":0,
  "Литературный редактор":0,
  "Спортивный тренер":0,
  "Професиональнй спортсмен":0,
  "Спортивный журналист":0,
  "Адвокат":0,
  "Судья":0,
  "Юрист корпорации":0,
  "Криминалист":0,
  "Фермер":0,
  "Агроном":0

}

def get_user_data_dict():
    return {
        "Архитектор":0,
        "Строитель":0,
        "Риэлтор":0,
        "Ландшафтный дизайнер":0,
        "Ученый":0,
        "Археолог":0,
        "Научный сотрудник":0,
        "Учитель":0,
        "Библиотекарь":0,
        "Менеджер по проектам":0,
        "Экономист":0,
        "Исполнительный директор":0,
        "Консультант по управлению":0,
        "Сисадмин":0,
        "Программист":0,
        "Специалист по кибербезопасности":0,
        "Аналитик данных":0,
        "Инженер по тестированию ПО":0,
        "Врач":0,
        "Фармацевт":0,
        "Физиотерапевт":0,
        "Нутрициолог":0,
        "Психотерапевт":0,
        "Финансовый аналитик":0,
        "Бухгалтер":0,
        "Инвестиционный аналитик":0,
        "Финансовый консультант":0,
        "Аудитор":0,
        "Технолог в машиностроении":0,
        "Инженер-механик":0,
        "Робототехник":0,
        "Монтажник оборудования":0,
        "Военный офицер":0,
        "Солдат":0,
        "Военный медик":0,
        "Инженер-исследователь":0,
        "Научный исследователь":0,
        "Биолог":0,
        "Физик":0,
        "Химик":0,
        "Менеджер по продажам":0,
        "Продавец-консультант":0,
        "Кассир":0,
        "Рабочий на производстве":0,
        "Технолог по текстилю":0,
        "Швея":0,
        "Дизайнер легкой промышленности":0,
        "Маркетолог":0,
        "Рекламщик":0,
        "Рукрутер":0,
        "Менеджер по продукту":0,
        "Водитель":0,
        "Логист":0,
        "Пилот":0,
        "Диспетчер":0,
        "Официант":0,
        "Парикмахер":0,
        "Мастер маникюра":0,
        "Бровист, Визажист":0,
        "Массажист":0,
        "Клининговая служба":0,
        "Гостиничный администратор":0,
        "Тур-агент":0,
        "Инженер по электронике и схемотехнике":0,
        "Инженер по проектированию микросхем":0,
        "Специалист по радиоэлектронике":0,
        "Художник":0,
        "Музыкант":0,
        "Режиссер":0,
        "Литературный редактор":0,
        "Спортивный тренер":0,
        "Професиональнй спортсмен":0,
        "Спортивный журналист":0,
        "Адвокат":0,
        "Судья":0,
        "Юрист корпорации":0,
        "Криминалист":0,
        "Фермер":0,
        "Агроном":0
    }